---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StairstypeHasLeftSupport
source: html/28a1adf9-8833-689a-6a09-2ce5b26c9b74.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StairstypeHasLeftSupport Property

"Left Support":

## Syntax (C#)
```csharp
public static ForgeTypeId StairstypeHasLeftSupport { get; }
```